SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( DEE_LordDuncan-D17
Type ( Engine )
WagonShape ( DEE_LordDuncan_MSTS.s )
Size  ( 2.793m 4.005m 12.929m )
CentreOfGravity ( 0m 1.96m 0.412m )

Name ( "DEE_LordDuncan discs 17" )

Include ( ..\\Common_Locomotives\\SR_LN_wagon.inc )

Comment ( ******************** Freight and Load Animations (If used) ********************
                Included in this section - Freight Animation information, etc
          *********************************************************************** )

ORTSFreightAnims (

FreightAnimStatic (
SubType( Default )
Shape ( Pcrew.s )
Offset( 0 0 10.2 ) )

FreightAnimStatic (
SubType( Default )
Shape ( LN_Extras-D17.s )
Offset( 0 0 0 ) )

)


Comment ( ************************ Lights (If used) ************************
            Included in this section - Type, Colour, Location, Size, Control, etc
          *********************************************************************** )

Lights(2
Light(
comment( Flickering firebox )
Type( 0 )
Conditions(
Headlight ( 0 )
Unit ( 0 )
)
FadeIn( 0.5 )
FadeOut( 0.5 )
Cycle( 0 )
States(2
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( -0 2.14 -4.5 )
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1 )
)
State(
Duration ( 0.05 )
LightColour ( 80ffe610 )
Position ( -0 2.14 -4.5 )
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1 )

)
)
)
Light(
comment( Cab glow )
Type( 0 )
Conditions(
Headlight ( 0 )
Unit ( 0 )
)
FadeIn( 0.5 )
FadeOut( 0.5 )
Cycle( 0 )
States(1
State(
Duration ( 0.0 )
LightColour ( 80ff7200 )
Position ( 0 2.34 -4.6 )
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1 )
)
)
)
)


Comment ( ********************* Wagon Visual Effects *********************
                      Included in this section - Effect type, etc
*********************************************************************** )

Effects(
SpecialEffects(

Comment( Steam Heating Hose Leak )
HeatingHoseFX(
-0.22 0.40 6.00
0 1 0
0.16 )

 ) )



 )


Engine ( DEE_LordDuncan_MSTS  

Effects (
SteamSpecialEffects (

StackFX (
0 3.90 4.50
0 1 0
0.4 )

WhistleFX (
0 3.97 -3.81
0 1 0
0.1 )

SafetyValvesFX (
0 3.94 -3.54
0 1 0
0.2 )
SafetyValvesFX (
0 3.94 -3.32
0 1 0
0.2 )

CylindersFX (
0.99 0.75 5.64
0 0 1
0.1 )
Cylinders2FX (
0.45 0.75 5.64
0 0 1
0.1 )
CylindersFX (
-0.45 0.75 5.64
0 0 1
0.1 )
Cylinders2FX (
-0.99 0.75 5.64
0 0 1
0.1 )
Cylinders2FX (
0.99 0.73 5.60
0 -0.1 1
0.1 )
CylindersFX (
0.45 0.73 5.60
0 -0.1 1
0.1 )
Cylinders2FX (
-0.45 0.73 5.60
0 -0.1 1
0.1 )
CylindersFX (
-0.99 0.73 5.60
0 -0.1 1
0.1 )

Injectors1FX (
-1.05 0.60 -5.00
0 -0.5 -1
0.08 )
Injectors2FX (
1.05 0.60 -5.00
0 -0.5 -1
0.08 )

)
)

Include ( ..\\Common_Locomotives\\SR_LN_engine.inc )

HeadOut (  1.7 3.1 -5.5 )

 Description (
 "30453 King Arthur was an N15 King Arthur Class locomotive built in 1925 at Eastleigh Works - this and others of the 1925 batch built at Eastleigh were known as Eastleigh Arthurs, to differentiate them from the earlier "Urie" Arthurs." 

"class withdrawals began in 1953 and were spread over 10 years - with King Arthur lasting until July 1961."

)
EngineOperatingProcedures (
"To move forward\n"+
"1.Press the W key several times to move the Reverser to full Forward.\n"+
"2.Press the ; (SEMICOLON) key to release the train brakes.\n"+
"3.Press the D key to increase the Regulator setting.\n"+  
"4.As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
"To slow the train\n"+
"1.Press the A key to move the Regulator to a lower setting.\n"+
"2.Use the brakes to further reduce speed if desired.\n\n"+
"To apply the train brakes\n"+
"1.Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
"To release the train brakes\n"+
"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
"To back up\n"+
"1.Bring your train to a full stop.\n"+ 
"2.Press the S key several times to move the Reverser to the full Reverse position.\n"+
"4.Press the ; (SEMICOLON) key to release the brakes.\n"+
"5.Slowly advance the regulator (D key).\n\n"+
"To load and unload passengers\n"+
"1. Stop at a station.\n"+
"2. Press the ENTER key.\n"+
"3. Wait for the \"permission to depart\" whistle.\n"+
"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
"To couple to a car or locomotive\n"+
"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
"TIP: To use the Coupling view, press the 6 key.\n"+
"2. Press F9 to open the Train Operations window.\n"+
"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
"4. Close the Train Operations window.\n\n"+
"To uncouple from a car or locomotive\n"+
"1. Press F9 to open the Train Operations window.\n"+
"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
"4. Close the Train Operations window.\n\n"+
"Firing commands (Automatic Fireman OFF in Options screen)\n"+
"To add coal to the firebox\n"+
"1. Press the F key to open the Firebox door.\n"+
"2. Press the R key to increase the shoveling rate.\n\n"+
"To stop adding coal to the fire\n"+
"1. Press SHIFT+R to decrease the shoveling rate.\n"+
"2. Press SHIFT+F to close the firebox door.\n\n"+
"To operate the blower\n"+
"1.Press the N key to increase the blower.\n"+
"2. Press SHIFT+N to decrease the blower.\n\n"+
"To operate the dampers\n"+
"1.Press the M key to open the dampers.\n"+
"2. Press SHIFT+M to close the dampers.\n\n"+
"To inject water into the boiler\n"+
"1.Press the I key to turn on the steam to Injector 1.\n"+
"(You can also press the O key to turn on the steam to Injector 2.)\n"+
"2.Press the K key to increase the water flow to Injector 1.\n"+
"(To increase the water flow to Injector 2, press the L key.)\n\n"+
"To stop boiler water injection\n"+ 
"1. Press the I key to turn off the steam to Injector 1.\n"+
"2. Press the O key to turn off the steam to Injector 2."
)
)